fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>ВКМ_Сотрудник</name>
    <type><types>CatalogRef.Пользователи</types></type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type><types>String</types><stringQualifiers><length>200</length></stringQualifiers></type>
  </attributes>
  <attributes>
    <name>ВКМ_Год</name>
    <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type><types>CatalogRef.Пользователи</types></type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресДанных = Неопределено;
	Параметры.Свойство("АдресДанныхГрафика", АдресДанных);
	Если НЕ ЗначениеЗаполнено(АдресДанных) Тогда
		Возврат;
	КонецЕсли;

	ДанныеГрафика = ПолучитьИзВременногоХранилища(АдресДанных);
	Если ТипЗнч(ДанныеГрафика) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ВКМ_ПостроитьДиаграммуГанта(ДанныеГрафика);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ПостроитьДиаграммуГанта(ДанныеГрафика)

	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОтображатьЛегенду = Ложь;

	ГодДокумента = ДанныеГрафика.Год;
	Если НЕ ЗначениеЗаполнено(ГодДокумента) Тогда
		ГодДокумента = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли;

	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(ГодДокумента), КонецГода(ГодДокумента));

	Серия = ДиаграммаГанта.Серии.Добавить();
	Серия.Текст = НСтр("ru = 'Отпуска'");

	ТочкиСотрудников = Новый Соответствие;
	Для Каждого СтрокаОтпуска Из ДанныеГрафика.Отпуска Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_Сотрудник)
			Или НЕ ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_ДатаНачала)
			Или НЕ ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;

		Точка = ТочкиСотрудников.Получить(СтрокаОтпуска.ВКМ_Сотрудник);
		Если Точка = Неопределено Тогда
			Точка = ДиаграммаГанта.Точки.Добавить();
			Точка.Текст = Строка(СтрокаОтпуска.ВКМ_Сотрудник);
			ТочкиСотрудников.Вставить(СтрокаОтпуска.ВКМ_Сотрудник, Точка);
		КонецЕсли;

		ЗначениеДиаграммы = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = ЗначениеДиаграммы.Добавить();
		Интервал.Начало = НачалоДня(СтрокаОтпуска.ВКМ_ДатаНачала);
		Интервал.Конец = КонецДня(СтрокаОтпуска.ВКМ_ДатаОкончания);
		Интервал.Текст = СтрШаблон("%1 - %2",
			Формат(СтрокаОтпуска.ВКМ_ДатаНачала, "ДЛФ=D"),
			Формат(СтрокаОтпуска.ВКМ_ДатаОкончания, "ДЛФ=D"));
	КонецЦикла;

	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
